w4kpm/stm32f429-discovery-chibios-pppos/main.c
}



void set_16(uint8_t *buffer, uint16_t data)
{    
    // Endianess differs - we need to swap the bytes

    int x;
    for (x=0;x<2;x++)
	*(buffer+x) = 0xFF & (data >> 8*(1-x));
}

uint8_t read_8(void)
{    
    // Endianess differs - we need to swap the bytes


    uint8_t data;
    int numbytes;
    data = 0;
    numbytes=lwip_recv(vncsocket,&data,1,0);
    if (numbytes != 1)
	log_data_num("read_8 Incorrect length\r\n",numbytes);
    return data;
}



uint16_t read_16(void)
{    
    // Endianess differs - we need to swap the bytes


    uint16_t data;
    int numbytes;
    ensure_bytes(2);
    data = data | vncbuffer[1];
    data = data | vncbuffer[0] << 8;
    return data;
}


uint32_t read_32(void)
{    
    // Endianess differs - we need to swap the bytes


    uint32_t data;
    int numbytes;
    data = 0;
    ensure_bytes(4);
    data = data | vncbuffer[3];
    data = data | vncbuffer[2] << 8;
    data = data | vncbuffer[1] << 16;
    data = data | vncbuffer[0] << 24;
    return data;
}



void set_32(uint8_t *buffer, uint32_t data)
{    
    // Endianess differs - we need to swap the bytes
    int x;
    for (x=0;x<4;x++)
	*(buffer+x) = 0xFF & (data >> 8*(3-x));
}





void read_all_data(char* str)
{
    /* reads all bytes left in queue - NB - it looks like lwip breaks 
       at the end of each remote transition, so even though this completes, 
       there may be another packet waiting */
    int x;
    int numbytes;
    numbytes=lwip_recv(vncsocket,&vncbuffer,1024,MSG_PEEK|MSG_DONTWAIT);
    if (numbytes ==0)
	{
	    chprintf((BaseSequentialStream*)&SD3,"%s: No Data\r\n",str);
	    return;
	}
    numbytes=lwip_recv(vncsocket,&vncbuffer,1024,0);
    chprintf((BaseSequentialStream*)&SD3,"%s Data Dump:\r\n    ",str);
    for (x=0;x<numbytes;x++)
	chprintf((BaseSequentialStream*)&SD3,"0x%X ",vncbuffer[x]);
    chprintf((BaseSequentialStream*)&SD3,"\r\n");


}



void read_copy_rect(int xpos, int ypos, int width, int height)
{
    uint16_t sourcex,sourcey;
    char text[255];
    sourcex = read_16();
    sourcey = read_16();
    //sprintf(text,"copy-rect. source %d,%d dest: %d,%d size:%d,%d\r\n",sourcex,sourcey,xpos,ypos,height,width);
    //log_data(text);
}


void read_raw_rect(int x,int y, int w, int h)
{
    int bytecount;
    char text[255];
    //log_data_num("reading %d bytes\r\n",(w * h * 4));
    ensure_bytes((w * h * 4));
	
}


uint8_t clipit (int currentpos, int maxpos)
{
    int currentx;
    currentx = currentpos*16;
    if ((currentx + 16) < maxpos)
	return 16;
    else
	return (16 - ( (currentx + 16) - maxpos));	    
}

// these may need to be kept between runs 
// the protocol only sends them once and then reuses them.
// I'm not sure if this is true between frame requeses,
// I made them global just in case.
uint32_t hextile_bg_color;
uint32_t hextile_fg_color;
void fill_rect(uint32_t color, int x, int y, int width, int height)
{
    char text[255];
    //sprintf(text,"Fill Rect %X pos:%d,%d size:%d,%d\r\n",color,x,y,height,width);
    //log_data(text);
}

void fill_rect2(uint32_t color, int x, int y, int width, int height) 
{
    DMA2D->CR = 3 << 16;
    DMA2D->OPFCCR = 0x2;
    DMA2D->OCOLR = color;
  
    DMA2D->OMAR = 0xD0000000 + (800 * y *2) + x*2;
    DMA2D->OOR = LCD_WIDTH - width;
    DMA2D->NLR = (uint32_t) ((width << 16) | height);
    DMA2D->CR |= 1;
    while (DMA2D->CR & DMA2D_CR_START) {
    }

}


void process_colored_rects(int rectCount, int startX, int startY)
{
    int count;
    uint32_t currentcolor;
    uint8_t xy,wh;
    uint8_t x,y,h,w;
    //log_data_num("start colored rects %d\r\n",rectCount);
    for (count = 0;count < rectCount; count++)
	{
	    //	    log_data_num("colored Rect #%d\r\n",count);
	    currentcolor = read_32();
	    xy = read_8();
	    wh = read_8();
	    y = xy & 0xf;
	    x = (xy & 0xf0) >> 4;
	    h = wh & 0xf;
	    w = (wh & 0xf0) >> 4;
	    fill_rect(currentcolor,startX + x,startY+y,w+1,h+1);
	}
}
	    
void process_foreground_rects(uint32_t fgcolor,int rectCount, int startX, int startY)
{
    int count;

    uint8_t xy,wh;
    uint8_t x,y,h,w;
    //log_data_num("start foreground rects %d\r\n",rectCount);
    for (count = 0;count < rectCount; count++)
	{
	    //	    log_data_num("foreground Rect #%d\r\n",count);
	    xy = read_8();
	    wh = read_8();
	    y = xy & 0xf;
	    x = (xy & 0xf0) >> 4;
	    h = wh & 0xf;
	    w = (wh & 0xf0) >> 4;
	    fill_rect(fgcolor,startX + x,startY+y,w+1,h+1);
	}
}
	    



void read_hextile_rect(int x,int y, int width, int height)
{
    int y2,x2;
    char text[255];
    uint8_t subencoding,raw,background,foreground,anysubrects,coloredrects;
    int newwidth,newheight;
    int subrect_count;
    for (y2=0;y2<height/16.0;y2++)
	for(x2=0;x2<width/16.0;x2++)
	    {
		//chThdSleepMilliseconds(10);
		subencoding = read_8();
		raw = subencoding & 1;
		background = subencoding & 2;
		foreground = subencoding & 4;
		anysubrects = subencoding & 8;
		coloredrects = subencoding & 16;
		//sprintf(text,"subencoding %X raw:%x bg:%x fg:%x asr:%x cr:%x\r\n",subencoding,
		//	raw,background,foreground,anysubrects,coloredrects);
		//log_data(text);
		newwidth = clipit(x2,width);
		newheight = clipit(y2,height);
		if (raw)
		    {
			//sprintf(text,"starting raw rect pos: %d,%d size:%d,%d\r\n",x+16*x2,y+16*y2,newwidth,newheight);
			//log_data(text);
			read_raw_rect(x+16*x2,y+16*y2,newwidth,newheight);
		    }
		else
		    {
			if (background)
			    {
				
				hextile_bg_color = read_32();
				//log_data_num("new bg color %X\r\n",hextile_bg_color);			    
			    }
			if (foreground)
			    {
				hextile_fg_color = read_32();
				//log_data_num("new fg color %X\r\n",hextile_fg_color);			    }
			    }
			if (anysubrects)
			    {
				subrect_count = read_8();
				//log_data_num("subrec Count %d\r\n",subrect_count);
			    }
			// fill bg rect here 
		        fill_rect(hextile_bg_color,x2*16+x,y2*16+y,newwidth,newheight);
			//  I think these are mutually exclusive.
			if (coloredrects)
			    process_colored_rects(subrect_count,x2*16+x,y2*16+y);
			else
			    if (anysubrects)
				process_foreground_rects(hextile_fg_color,subrect_count,x2*16+x,y2*16+y);
		    }
		
		
		
