w4kpm/stm32f429-discovery-chibios-pppos/main.c
	while (!chThdShouldTerminateX()) {
	    chprintf((BaseSequentialStream*)&SD3,"Attempting to rx\r\n");
	    newsockfd = lwip_accept(sock, (struct sockaddr *) &cli_addr,
				    &cli_addr_len);
	    if (newsockfd < 0) {
		break;
	    }
	    chprintf((BaseSequentialStream*)&SD3,"Accepted\r\n");
	    chThdSleepMilliseconds(100);
	    while (!chThdShouldTerminateX()) {

		recsize = lwip_recvfrom(newsockfd, buffer, sizeof(buffer), 0,
				(struct sockaddr *) &sa, &fromlen);
		chprintf((BaseSequentialStream*)&SD3,"recsize %d - fromlen %d\r\n",recsize,fromlen);
		if (recsize < 0) {
			break;
		}
		pass ++;
		if (pass%2 ==0)
		    {
			palClearPad(GPIOG, 14);
		    }
		else
		    {
			palSetPad(GPIOG, 14);
		    }

		lwip_sendto(newsockfd, (void *) buffer, recsize, 0, (struct sockaddr *) &sa,
				fromlen);
	    }
	    lwip_close(sock);
	}

	lwip_close(sock);

	return MSG_OK;
}


/*
 * TCP Shell server thread
 */

static THD_WORKING_AREA(waShellServerThread, 512);
static THD_FUNCTION(ShellServerThread, arg) {
	(void) arg;

	int sockfd, newsockfd;
	socklen_t cli_addr_len;
	struct sockaddr_in serv_addr, cli_addr;

	SocketStream sbp;
	ShellConfig shell_cfg;
	thread_t *shelltp;

	chRegSetThreadName("ShellServerThread");
	chprintf((BaseSequentialStream*)&SD3,"Shell Server Starting \r\n");

	memset(&serv_addr, 0, sizeof(serv_addr));
	serv_addr.sin_family = AF_INET;
	serv_addr.sin_addr.s_addr = htonl(INADDR_ANY);
	serv_addr.sin_port = PP_HTONS(25);

	sockfd = lwip_socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
	if (sockfd < 0)
		return MSG_RESET;

	if (lwip_bind(sockfd, (const struct sockaddr *) &serv_addr, sizeof(serv_addr)) < 0) {
		lwip_close(sockfd);
		return MSG_RESET;
	}

	if (lwip_listen(sockfd, 1) < 0) {
		lwip_close(sockfd);
		return MSG_RESET;
	}

	cli_addr_len = sizeof(cli_addr);

	while (!chThdShouldTerminateX()) {
		newsockfd = lwip_accept(sockfd, (struct sockaddr *) &cli_addr,
				&cli_addr_len);
		if (newsockfd < 0) {
			break;
		}

		ssObjectInit(&sbp, newsockfd);
		shell_cfg.sc_channel = (BaseSequentialStream*) &sbp;
		shell_cfg.sc_commands = shell_commands;

		shelltp = shellCreate(&shell_cfg, SHELL_WA_SIZE, NORMALPRIO+2);
		chThdWait(shelltp);

		lwip_close(newsockfd);
	}

	if (lwip_shutdown(sockfd, SHUT_RDWR) < 0) {
		// oops
	}
	lwip_close(sockfd);

	return MSG_OK;
}


static THD_WORKING_AREA(waShellServerThread2, 512);
static THD_FUNCTION(ShellServerThread2, arg) {
	(void) arg;


	ShellConfig shell_cfg;
	thread_t *shelltp;

	chRegSetThreadName("ShellServerThread2");

	shell_cfg.sc_channel = (BaseSequentialStream*) &SD3;
	shell_cfg.sc_commands = shell_commands;

	shelltp = shellCreate(&shell_cfg, SHELL_WA_SIZE, NORMALPRIO+2);
		chThdWait(shelltp);


	return MSG_OK;
}

/*
 * Handle link status events
 */
static void ppp_linkstatus_callback(void *ctx, int errCode, void *arg) {
	(void) arg;

	volatile int *connected = (int*)ctx;
	chprintf((BaseSequentialStream*)&SD3,"callback %x\r\n",errCode);
	chThdSleepMilliseconds(100);

	if (errCode == PPPERR_NONE) {
		*connected = 1;
	} else {
		*connected = 0;
	}
}


uint32_t Current_color;




int main(void) {
    //  unsigned i;
  thread_t *echoServerThread = 0;
  thread_t *shellServerThread = 0;
  thread_t *shellServerThread2 = 0;

  /*
   * System initializations.
   * - HAL initialization, this also initializes the configured device drivers
   *   and performs the board-specific initializations.
   * - Kernel initialization, the main() function becomes a thread and the
   *   RTOS is active.
   */
  uint32_t i;
  halInit();
  chSysInit();

  /*
   * SPI1 I/O pins setup.
   */
  palSetPadMode(GPIOB, 6, PAL_MODE_ALTERNATE(7));    
  palSetPadMode(GPIOB, 7, PAL_MODE_ALTERNATE(7));
  palSetPadMode(GPIOB, 10, PAL_MODE_ALTERNATE(7));    
  palSetPadMode(GPIOB, 11, PAL_MODE_ALTERNATE(7));
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIOCEN |
      RCC_AHB1ENR_GPIODEN | RCC_AHB1ENR_GPIOEEN | RCC_AHB1ENR_GPIOFEN |
      RCC_AHB1ENR_GPIOGEN;

  chMtxObjectInit(&SD3mtx);
  sdStart(&SD1, &uartCfg);
  sdStart(&SD3, &uartCfg);

  palSetPadMode(GPIOG, 13, PAL_MODE_OUTPUT_PUSHPULL); 
  palSetPadMode(GPIOG, 14, PAL_MODE_OUTPUT_PUSHPULL );
  chThdCreateStatic(waThread1, sizeof(waThread1), NORMALPRIO + 1, Thread1, NULL);
  RCC->AHB1ENR |= RCC_AHB1ENR_DMA2DEN;

  SDRAM_Init();
  TFTLCD_Init();
  //  chThdSleepMilliseconds(1000);

  //for(i = 0xD0000000; i < 0xD0000000 + 0xBB800; i += 2)
  //  *(uint16_t *)i = 0x0700;
  fill_rect2(0x0000,0,0,800,480);
  fill_rect2(0x0700,200,100,100,100);
  fill_rect2(0x001f,200,200,100,100);
  fill_rect2(0xf000,100,100,100,100);





  printf("test from printf \r\n");
  chprintf((BaseSequentialStream*)&SD3,"After start thread\r\n");
  chThdSleepMilliseconds(100);


  palSetPad(GPIOG, 14);

  chprintf((BaseSequentialStream*)&SD3,"After set pad Init\r\n");
  chThdSleepMilliseconds(100);


  tcpip_init(NULL, NULL);
  chprintf((BaseSequentialStream*)&SD3,"After tcp Init\r\n");
  chThdSleepMilliseconds(100);



  pppInit();
  chprintf((BaseSequentialStream*)&SD3,"After PPP Init\r\n");
  chThdSleepMilliseconds(100);




  shellInit();
  chprintf((BaseSequentialStream*)&SD3,"After Shell Init\r\n");
  chThdSleepMilliseconds(100);
  chThdSetPriority(PPP_THREAD_PRIO + 1);

  chprintf((BaseSequentialStream*)&SD3,"After set Priority\r\n");
  chThdSleepMilliseconds(100);

	while (TRUE) {
		volatile int connected = 0;

		int pd = pppOverSerialOpen(&SD1, ppp_linkstatus_callback,
				(int*) &connected);

		if (pd < 0) {
			chThdSleep(MS2ST(100));
			continue;
		}
		chprintf((BaseSequentialStream*)&SD3,"After ppp open\r\n");
		chThdSleepMilliseconds(100);


		// Wait for initial connection
		int timeout = 0;

		while (connected < 1) {
			chThdSleep(MS2ST(500));
			if(timeout++ > 10) {  // If we waited too long restart connection
			    chprintf((BaseSequentialStream*)&SD3,"Close Connection - too long\r\n");
			    chThdSleepMilliseconds(100);

				pppClose(pd);
				break;
			}
			
		}
		chprintf((BaseSequentialStream*)&SD3,"entering connection \r\n");

		// Make sure connection is stable
		while (connected < 5) {
			chThdSleep(MS2ST(100));
			printf("Connected\r\n");
			if (connected == 0) { // reset by pppThread while waiting for stable connection
			    chprintf((BaseSequentialStream*)&SD3,"Close Connection - not stable\r\n");
			    chThdSleepMilliseconds(100);

				pppClose(pd);
				break;
			}
			connected++;
		}

		// Run server threads

		echoServerThread = chThdCreateStatic(waVncThread,
						     sizeof(waVncThread), NORMALPRIO + 2, VncThread, NULL);

		//		echoServerThread = chThdCreateStatic(waEchoServerThread,
		//						     sizeof(waEchoServerThread), NORMALPRIO + 1, EchoServerThread, NULL);
		//		shellServerThread = chThdCreateStatic(waShellServerThread,
		//						      sizeof(waShellServerThread), NORMALPRIO + 1, ShellServerThread,
		//						NULL);

		/*		shellServerThread2 = chThdCreateStatic(waShellServerThread2,
				sizeof(waShellServerThread2), NORMALPRIO + 1, ShellServerThread2,
				NULL);*/

		while (connected > 0) {
			chThdSleep(MS2ST(200));
		}

		// Tear down threads
		chThdTerminate(echoServerThread);
		chThdWait(echoServerThread);
		chThdTerminate(shellServerThread);
		chThdWait(shellServerThread);
	}

  return 0;
}



